# Taps
tap "homebrew/bundle"

# CLI tools
brew "fish"
brew "stow"
brew "git-delta"
brew "zoxide"
brew "direnv"
brew "fnm"
brew "go"
brew "neovim"
brew "tmux"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "bat"
brew "lazygit"
brew "jq"
brew "curl"
brew "wget"
brew "htop"
brew "tree"
brew "jujutsu"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Browsers
cask "google-chrome"
cask "firefox"

# Productivity
cask "1password"
cask "1password-cli"

# Development
cask "ghostty"
cask "visual-studio-code"
cask "docker"

# Media
cask "spotify"
